zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_rtc_common.h
/*! @enum DLRTC_COMMON_STATUS / RTC就绪状态 */
typedef enum {
    /*! RTC Common is safe for reading / 可安全读取 */
    DL_RTC_COMMON_STATUS_READY = RTC_STA_RTCRDY_READY,
    /*! RTC Common is not safe for reading / 不可安全读取 */
    DL_RTC_COMMON_STATUS_NOT_READY = RTC_STA_RTCRDY_NOT_READY
} DL_RTC_COMMON_STATUS;

/*! @enum DL_RTC_COMMON_COMPENSATION_STATUS / 补偿就绪状态 */
typedef enum {
    /*! RTC Common ready to get new compensation values / 可接受新补偿值 */
    DL_RTC_COMMON_COMPENSATION_STATUS_READY = RTC_STA_RTCTCRDY_READY,
    /*! RTC Common not ready to get new compensaiton values / 不可接受新补偿值 */
    DL_RTC_COMMON_COMPENSATION_STATUS_NOT_READY = RTC_STA_RTCTCRDY_NOT_READY
} DL_RTC_COMMON_COMPENSATION_STATUS;

/*! @enum DL_RTC_COMMON_COMPENSATION_WRITE_RESULT / 补偿写入结果 */
typedef enum {
    /*! Compensation write successful / 写入成功 */
    DL_RTC_COMMON_COMPENSATION_WRITE_RESULT_OK = RTC_STA_RTCTCOK_OK,
    /*! Compensation write unsuccessful / 写入失败 */
    DL_RTC_COMMON_COMPENSATION_WRITE_RESULT_NOT_OK = RTC_STA_RTCTCOK_NOT_OK
} DL_RTC_COMMON_COMPENSATION_WRITE_RESULT;

/*! @enum DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN / 偏移校准方向 */
typedef enum {
    /*! Calibration frequency adjusted down / 频率下调 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN_DOWN = RTC_CAL_RTCOCALS_DOWN,
    /*! Calibration frequency adjusted up / 频率上调 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN_UP = RTC_CAL_RTCOCALS_UP
} DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN;

/*! @enum DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY / 偏移校准输出频率 */
typedef enum {
    #ifdef __MSPM0_HAS_RTC__
    /*! No frequency output to RTCCLK pin / 无频率输出 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY_OFF = RTC_CAL_RTCCALFX_OFF,
    #endif
    #ifdef __MSPM0_HAS_RTC_A__
    /*! 32 kHz frequency output to RTCLK pin / 32kHz输出 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY_32_KHZ = LFSS_CAL_RTCCALFX_F32KHZ,
    #endif
    /*! 512 Hz frequency output to RTCLK pin / 512Hz输出 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY_512 = RTC_CAL_RTCCALFX_F512HZ,
    /*! 256 Hz frequency output to RTCLK pin / 256Hz输出 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY_256 = RTC_CAL_RTCCALFX_F256HZ,
    /*! 1 Hz frequency output to RTCLK pin / 1Hz输出 */
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY_1 = RTC_CAL_RTCCALFX_F1HZ
} DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY;

/*! @enum DL_RTC_COMMON_TEMP_CALIBRATION / 温度补偿方向 */
typedef enum {
    /*! Calibrate at steps of -1 / -1ppm步进 */
    DL_RTC_COMMON_TEMP_CALIBRATION_DOWN1PPM = RTC_TCMP_RTCTCMPS_DOWN,
    /*! Calibrate at steps of +1 / +1ppm步进 */
    DL_RTC_COMMON_TEMP_CALIBRATION_UP1PPM = RTC_TCMP_RTCTCMPS_UP
} DL_RTC_COMMON_TEMP_CALIBRATION;

/*! @enum DL_RTC_COMMON_FORMAT / 时钟格式 */
typedef enum {
    /*! Select binary format for the real-time clock / 二进制格式 */
    DL_RTC_COMMON_FORMAT_BINARY = RTC_CTL_RTCBCD_BINARY,
    /*! Select BCD format for the real-time clock / BCD格式 */
    DL_RTC_COMMON_FORMAT_BCD = RTC_CTL_RTCBCD_BCD
} DL_RTC_COMMON_FORMAT;

/*! @enum DL_RTC_COMMON_INTERVAL_ALARM / 间隔闹钟条件 */
typedef enum {
    /*! Assert Calendar interrupt on every minute / 每分钟触发 */
    DL_RTC_COMMON_INTERVAL_ALARM_MINUTECHANGE = RTC_CTL_RTCTEVTX_MINUTE,
    /*! Assert Calendar interrupt on every hour / 每小时触发 */
    DL_RTC_COMMON_INTERVAL_ALARM_HOURCHANGE = RTC_CTL_RTCTEVTX_HOUR,
    /*! Assert Calendar interrupt when hour is 12 / 中午12点触发 */
    DL_RTC_COMMON_INTERVAL_ALARM_NOON = RTC_CTL_RTCTEVTX_NOON,
    /*! Assert Calendar interrupt when hour is 0 / 午夜0点触发 */
    DL_RTC_COMMON_INTERVAL_ALARM_MIDNIGHT = RTC_CTL_RTCTEVTX_MIDNIGHT
} DL_RTC_COMMON_INTERVAL_ALARM;

/*! @enum DL_RTC_COMMON_PRESCALER0_DIVIDE / 预分频器0分频系数 */
typedef enum {
    /*! Prescaler 0 Divide by 8 / 8分频 */
    DL_RTC_COMMON_PRESCALER0_DIVIDE_8 = RTC_PSCTL_RT0IP_DIV8,
    /*! Prescaler 0 Divide by 16 / 16分频 */
    DL_RTC_COMMON_PRESCALER0_DIVIDE_16 = RTC_PSCTL_RT0IP_DIV16,
    /*! Prescaler 0 Divide by 32 / 32分频 */
    DL_RTC_COMMON_PRESCALER0_DIVIDE_32 = RTC_PSCTL_RT0IP_DIV32,
    /*! Prescaler 0 Divide by 64 / 64分频 */
    DL_RTC_COMMON_PRESCALER0_DIVIDE_64 = RTC_PSCTL_RT0IP_DIV64,
    /*! Prescaler 0 Divide by 128 / 128分频 */
    DL_RTC_COMMON_PRESCALER0_DIVIDE_128 = RTC_PSCTL_RT0IP_DIV128,
    /*! Prescaler 0 Divide by 256 / 256分频 */
    DL_RTC_COMMON_PRESCALER0_DIVIDE_256 = RTC_PSCTL_RT0IP_DIV256
} DL_RTC_COMMON_PRESCALER0_DIVIDE;

/*! @enum DL_RTC_COMMON_PRESCALER1_DIVIDE / 预分频器1分频系数 */
typedef enum {
    /*! Prescaler 1 Divide by 2 / 2分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_2 = RTC_PSCTL_RT1IP_DIV2,
    /*! Prescaler 1 Divide by 4 / 4分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_4 = RTC_PSCTL_RT1IP_DIV4,
    /*! Prescaler 1 Divide by 8 / 8分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_8 = RTC_PSCTL_RT1IP_DIV8,
    /*! Prescaler 1 Divide by 16 / 16分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_16 = RTC_PSCTL_RT1IP_DIV16,
    /*! Prescaler 1 Divide by 32 / 32分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_32 = RTC_PSCTL_RT1IP_DIV32,
    /*! Prescaler 1 Divide by 64 / 64分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_64 = RTC_PSCTL_RT1IP_DIV64,
    /*! Prescaler 1 Divide by 128 / 128分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_128 = RTC_PSCTL_RT1IP_DIV128,
    /*! Prescaler 1 Divide by 256 / 256分频 */
    DL_RTC_COMMON_PRESCALER1_DIVIDE_256 = RTC_PSCTL_RT1IP_DIV256
} DL_RTC_COMMON_PRESCALER1_DIVIDE;

/*! @enum DL_RTC_COMMON_PRESCALER2_DIVIDE / 预分频器2分频系数 */
typedef enum {
    /*! Interval every 4 seconds / 每4秒 */
    DL_RTC_COMMON_PRESCALER2_4_SEC = RTC_EXTPSCTL_RT2PS_INT4S,
    /*! Interval every 8 seconds / 每8秒 */
    DL_RTC_COMMON_PRESCALER2_8_SEC = RTC_EXTPSCTL_RT2PS_INT8S,
    /*! Interval every 16 seconds / 每16秒 */
    DL_RTC_COMMON_PRESCALER2_16_SEC = RTC_EXTPSCTL_RT2PS_INT16S
} DL_RTC_COMMON_PRESCALER2_DIVIDE;

/*! @enum DL_RTC_COMMON_IIDX / 中断索引 */
typedef enum {
    /*! RTC Common interrupt index for alarm 1 / 闹钟1 */
    DL_RTC_COMMON_IIDX_ALARM1 = RTC_CPU_INT_IIDX_STAT_RTCA1,
    /*! RTC Common interrupt index for alarm 2 / 闹钟2 */
    DL_RTC_COMMON_IIDX_ALARM2 = RTC_CPU_INT_IIDX_STAT_RTCA2,
    /*! RTC Common interrupt index for prescaler 0 / 预分频器0 */
    DL_RTC_COMMON_IIDX_PRESCALER0 = RTC_CPU_INT_IIDX_STAT_RT0PS,
    /*! RTC Common interrupt index for prescaler 1 / 预分频器1 */
    DL_RTC_COMMON_IIDX_PRESCALER1 = RTC_CPU_INT_IIDX_STAT_RT1PS,
    /*! RTC Common interrupt index for prescaler 2 / 预分频器2 */
    DL_RTC_COMMON_IIDX_PRESCALER2 = RTC_CPU_INT_IIDX_STAT_RT2PS,
    /*! RTC Common interrupt index for interval timer / 间隔定时器 */
    DL_RTC_COMMON_IIDX_INTERVAL_TIMER = RTC_CPU_INT_IIDX_STAT_RTCTEV,
    /*! RTC Common interrupt index for RTC Common ready / 就绪 */
    DL_RTC_COMMON_IIDX_READY = RTC_CPU_INT_IIDX_STAT_RTCRDY,
    /*! RTC Common interrupt index for Time Stamp / 时间戳 */
    #ifdef __MSPM0_HAS_RTC_A__
    DL_RTC_COMMON_IIDX_TSEVT = RTC_CPU_INT_IIDX_STAT_TSEVT,
    /*! RTC Common interrupt index for Tamper IO 0 / 防篡改IO 0 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_0 = RTC_CPU_INT_IIDX_STAT_TIO0,
    /*! RTC Common interrupt index for Tamper IO 1 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_1 = RTC_CPU_INT_IIDX_STAT_TIO1,
    /*! RTC Common interrupt index for Tamper IO 2 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_2 = RTC_CPU_INT_IIDX_STAT_TIO2,
    /*! RTC Common interrupt index for Tamper IO 3 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_3 = RTC_CPU_INT_IIDX_STAT_TIO3,
    /*! RTC Common interrupt index for Tamper IO 4 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_4 = RTC_CPU_INT_IIDX_STAT_TIO4,
    /*! RTC Common interrupt index for Tamper IO 5 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_5 = RTC_CPU_INT_IIDX_STAT_TIO5,
    /*! RTC Common interrupt index for Tamper IO 6 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_6 = RTC_CPU_INT_IIDX_STAT_TIO6,
    /*! RTC Common interrupt index for Tamper IO 7 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_7 = RTC_CPU_INT_IIDX_STAT_TIO7,
    /*! RTC Common interrupt index for Tamper IO 8 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_8 = RTC_CPU_INT_IIDX_STAT_TIO8,
    /*! RTC Common interrupt index for Tamper IO 9 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_9 = RTC_CPU_INT_IIDX_STAT_TIO9,
    /*! RTC Common interrupt index for Tamper IO 10 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_10 = RTC_CPU_INT_IIDX_STAT_TIO10,
    /*! RTC Common interrupt index for Tamper IO 11 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_11 = RTC_CPU_INT_IIDX_STAT_TIO11,
    /*! RTC Common interrupt index for Tamper IO 12 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_12 = RTC_CPU_INT_IIDX_STAT_TIO12,
    /*! RTC Common interrupt index for Tamper IO 13 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_13 = RTC_CPU_INT_IIDX_STAT_TIO13,
    /*! RTC Common interrupt index for Tamper IO 14 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_14 = RTC_CPU_INT_IIDX_STAT_TIO14,
    /*! RTC Common interrupt index for Tamper IO 15 */
    DL_RTC_COMMON_IIDX_TAMPER_IO_15 = RTC_CPU_INT_IIDX_STAT_TIO15,
    #endif
} DL_RTC_COMMON_IIDX;

#ifdef __MSPM0_HAS_RTC_A__
/*! @enum DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE / 时间戳捕获模式 */
typedef enum {
    /*! Time stamp holds RTC capture at first occurrence of time stamp event / 捕获首次事件 */
    DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE_FIRST = RTC_TSCTL_TSCAPTURE_FIRST,
    /*! Time stamp holds RTC capture at last occurrence of time stamp event / 捕获末次事件 */
    DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE_LAST = RTC_TSCTL_TSCAPTURE_LAST,
} DL_RTC_COMMON_TIME_STAMP_EVENT_CAPTURE;
#endif

/* clang-format on */

/**
 * @brief   Alarm struct to use in DL_RTC_Common_setCalendarAlarm / 闹钟结构体
 *
 * @note    All struct values must be in the same format (Binary OR BCD).
 *          RTC Common format is set during initialization.
 * @note    所有字段必须使用相同格式（二进制或BCD），格式在初始化时设定。
 */
typedef struct {
    /** The minute to set the Alarm time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. / 闹钟分 */
    uint8_t minutes;
    /** The hour to set the Alarm time to. Valid values are 0-23 in Binary
     * format OR 0x0-0x23 in BCD format. / 闹钟时 */
    uint8_t hours;
    /** The day of the week to set the Alarm time to. Valid values are 0-6
     * in Binary format OR 0x0-0x6 in BCD format. / 闹钟星期 */
    uint8_t dayOfWeek;
    /** The day of the month to set the Alarm time to. Valid values are 1-31
     * in Binary format OR 0x1-0x31 in BCD format. / 闹钟日 */
    uint8_t dayOfMonth;
} DL_RTC_Common_CalendarAlarm;

/**
 * @brief   Calendar struct to use in DL_RTC_Common_initCalendar() / 日历时间结构体
 *
 * @note    All struct values must be in the same format (Binary OR BCD).
 *          RTC Common format is set during initialization.
 * @note    所有字段必须使用相同格式（二进制或BCD），格式在初始化时设定。
 */
typedef struct {
    /** The second to set the Calendar time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. / 秒 */
    uint8_t seconds;
    /** The minute to set the Calendar time to. Valid values are 0-59 in Binary
     * format OR 0x0-0x59 in BCD format. / 分 */
    uint8_t minutes;
    /** The hour to set the Calendar time to. Valid values are 0-23 in Binary
     * format OR 0x0-0x23 in BCD format. / 时 */
    uint8_t hours;
    /** The day of the week to set the Calendar time to. Valid values are 0-6
     * in Binary format OR 0x0-0x6 in BCD format. / 星期 */
    uint8_t dayOfWeek;
    /** The day of the month to set the Calendar time to. Valid values are 1-31
     * in Binary format OR 0x1-0x31 in BCD format. / 日 */
    uint8_t dayOfMonth;
    /** The month to set the Calendar time to. Valid values are 1-12 in Binary
     * format OR 0x1-0x12 in BCD format. / 月 */
    uint8_t month;
    /** The year to set the Calendar time to. Valid values are 0-4095 in Binary
     * format OR 0x0-0x4095 in BCD format. / 年 */
    uint16_t year;
} DL_RTC_Common_Calendar;

/**
 *  @brief Returns if LFCLK is selected as clock source / 检查时钟源是否为LFCLK
 *
 * If the LFCLK is enabled, the RTC Common module will select it as the clock source.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral / RTC外设寄存器基地址
 *
 *  @return true  If LFCLK is selected as the clock source / LFCLK已选为时钟源
 *  @return false If LFCLK is not selected as the clock source / LFCLK未选为时钟源
 */
__STATIC_INLINE bool DL_RTC_Common_isClockSourceLFCLK(
    const RTC_Regs *rtc_common)
{
    return ((rtc_common->CLKSEL & RTC_CLKSEL_LFCLK_SEL_MASK) ==
            RTC_CLKSEL_LFCLK_SEL_MASK);
}

/**
 *  @brief      Enables the supply of the 32kHz clock to the RTC Common. It will not
 *              power up the 32kHz crystal oscillator. This needs to be done
 *              in the Clock System Module. / 使能32kHz时钟供给RTC（不启动晶振）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableClockControl(RTC_Regs *rtc_common)
{
    rtc_common->CLKCTL = RTC_CLKCTL_MODCLKEN_ENABLE;
}

/**
 *  @brief      Disables the supply of the 32kHz clock to the RTC Common. / 禁用32kHz时钟供给
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableClockControl(RTC_Regs *rtc_common)
{
    rtc_common->CLKCTL = RTC_CLKCTL_MODCLKEN_DISABLE;
}

/**
 * @brief Enables the Peripheral Write Enable (PWREN) register for the RTC / 使能RTC外设电源
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enablePower(RTC_Regs *rtc_common)
{
    rtc_common->GPRCM.PWREN =
        (RTC_PWREN_KEY_UNLOCK_W | RTC_PWREN_ENABLE_ENABLE);
}

/**
 * @brief Disables the Peripheral Write Enable (PWREN) register for the RTC / 禁用RTC外设电源
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @note This API does not provide large power savings.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disablePower(RTC_Regs *rtc_common)
{
    rtc_common->GPRCM.PWREN =
        (RTC_PWREN_KEY_UNLOCK_W | RTC_PWREN_ENABLE_DISABLE);
}

/**
 * @brief Returns if the Peripheral Write Enable (PWREN) register for the RTC
 *        is enabled / 检查RTC外设电源是否已使能
 *
 *  Before any peripheral registers can be configured by software, the
 *  peripheral itself must be enabled by writing the ENABLE bit together with
 *  the appropriate KEY value to the peripheral's PWREN register.
 *
 *  When the PWREN.ENABLE bit is cleared, the peripheral's registers are not
 *  accessible for read/write operations.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 * @return true if peripheral register access is enabled
 * @return false if peripheral register access is disabled
 */
__STATIC_INLINE bool DL_RTC_Common_isPowerEnabled(const RTC_Regs *rtc_common)
{
    return ((rtc_common->GPRCM.PWREN & RTC_PWREN_ENABLE_MASK) ==
            RTC_PWREN_ENABLE_ENABLE);
}

/**
 *  @brief      Resets all registers in the RTC Common module. / 复位RTC所有寄存器
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_reset(RTC_Regs *rtc_common)
{
    rtc_common->GPRCM.RSTCTL =
        (RTC_RSTCTL_KEY_UNLOCK_W | RTC_RSTCTL_RESETSTKYCLR_CLR |
            RTC_RSTCTL_RESETASSERT_ASSERT);
}

/**
 *  @brief      Returns if the RTC Common module was reset / 检查RTC是否已复位
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return true if module was reset
 *  @return false if module was not reset
 */
__STATIC_INLINE bool DL_RTC_Common_isReset(const RTC_Regs *rtc_common)
{
    return ((rtc_common->GPRCM.STAT & RTC_STAT_RESETSTKY_MASK) ==
            RTC_STAT_RESETSTKY_RESET);
}

/**
 *  @brief      Enables interrupts when the CPU is in debug mode. Interrupt
 *              requests are signaled to the interrupt controller. / 使能调试模式中断
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableDebugInterrupts(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL |= RTC_DBGCTL_DBGINT_ON;
}

/**
 *  @brief      Disables interrupts when the CPU is in debug mode. Interrupts
 *              of the RTC Common module will not be captured. There will be no
 *              updates to the RTCRIS, RTCMISC and RTCIIDX registers. / 禁用调试模式中断
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableDebugInterrupts(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL &= ~(RTC_DBGCTL_DBGINT_MASK);
}

/**
 *  @brief      Enables the RTC Common modules debug mode. / 使能调试模式
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_enableDebugMode(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL |= RTC_DBGCTL_DBGRUN_RUN;
}

/**
 *  @brief      Disables the RTC Common modules debug mode. / 禁用调试模式
 *
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 */
__STATIC_INLINE void DL_RTC_Common_disableDebugMode(RTC_Regs *rtc_common)
{
    rtc_common->DBGCTL &= ~(RTC_DBGCTL_DBGRUN_MASK);
}

/**
 *  @brief      Set the format of the real-time clock / 设置时钟格式
 *
 * The format must be selected before the time is set.
 *
 *  @param[in]  rtc_common     Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  formatSelect    Selectable format the RTC Common peripheral will
 *                              provide time in. One of @ref DL_RTC_COMMON_FORMAT
 */
__STATIC_INLINE void DL_RTC_Common_setClockFormat(
    RTC_Regs *rtc_common, DL_RTC_COMMON_FORMAT formatSelect)
{
    rtc_common->CTL |= (uint32_t) formatSelect;
}

/**
 *  @brief      Get the format currently being used for counting the
 *              real-time clock. / 获取当前时钟格式
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Format for counting the real-time clock.
 *
 *  @retval            One of @ref DL_RTC_COMMON_FORMAT
 */
__STATIC_INLINE DL_RTC_COMMON_FORMAT DL_RTC_Common_getClockFormat(
    const RTC_Regs *rtc_common)
{
    uint32_t format = (rtc_common->CTL & RTC_CTL_RTCBCD_MASK);

    return (DL_RTC_COMMON_FORMAT)(format);
}

/**
 *  @brief      Sets the interval alarm event condition / 设置间隔闹钟条件
 *
 * The interval alarm can be configured to generate an interval alarm event
 * when one of the following events occurs:
 * - MIN changes
 * - HOUR changes
 * - Every day at midnight (00:00:00)
 * - Every day at noon (12:00:00)
 *
 * The interval alarm sources the @ref DL_RTC_COMMON_INTERRUPT_INTERVAL_ALARM interrupt
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  alarmEvent  The interval alarm interrupt condition. One of
 *                          @ref DL_RTC_COMMON_INTERVAL_ALARM
 */
__STATIC_INLINE void DL_RTC_Common_setIntervalAlarm(
    RTC_Regs *rtc_common, DL_RTC_COMMON_INTERVAL_ALARM alarmEvent)
{
    DL_Common_updateReg(
        &rtc_common->CTL, (uint32_t) alarmEvent, RTC_CTL_RTCTEVTX_MASK);
}

/**
 *  @brief      Gets the interval alarm event condition / 获取间隔闹钟条件
 *
 * The interval alarm can be configured to generate an interval alarm event
 * when one of the following events occurs:
 * - MIN changes
 * - HOUR changes
 * - Every day at midnight (00:00:00)
 * - Every day at noon (12:00:00)
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return DL_RTC_COMMON_INTERVAL_ALARM
 */
__STATIC_INLINE DL_RTC_COMMON_INTERVAL_ALARM DL_RTC_Common_getIntervalAlarm(
    const RTC_Regs *rtc_common)
{
    uint32_t alarm = (rtc_common->CTL & RTC_CTL_RTCTEVTX_MASK);

