zejun051019/2026-NUEDC-H-MSPM0G3507/include/core/ti/driverlib/dl_rtc_common.h
    return (DL_RTC_COMMON_INTERVAL_ALARM)(alarm);
}

/**
 *  @brief      Checks if RTC Common is safe for reading / 检查RTC是否可安全读取
 *
 * This API checks if the counter/calender registers can be safely read.
 *
 * The RTC Common counter/calendar registers are updated once per second. To prevent
 * reading any counter/calendar register at the time of an update (which could
 * result in an invalid time being read), a keep-out window is provided. The
 * keep-out window is approximately 128/32768 seconds before the counters
 * update.
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return true if RTC Common is safe for reading
 *  @return false if RTC Common values are in transition
 *
 */
__STATIC_INLINE bool DL_RTC_Common_isSafeToRead(const RTC_Regs *rtc_common)
{
    return ((rtc_common->STA & RTC_STA_RTCRDY_MASK) == RTC_STA_RTCRDY_READY);
}

/**
 *  @brief      Checks if RTC Common is ready to get new calibration values / 检查是否可写入校准值
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return true if RTC Common can get new calibration values
 *  @return false if RTC Common is not ready to get new calibration values
 *
 */
__STATIC_INLINE bool DL_RTC_Common_isReadyToCalibrate(
    const RTC_Regs *rtc_common)
{
    return (
        (rtc_common->STA & RTC_STA_RTCTCRDY_MASK) == RTC_STA_RTCTCRDY_READY);
}

/**
 *  @brief      Checks if RTC Common new calibration values were written OK / 检查校准写入是否成功
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return true if calibration write was successful
 *  @return false if calibration write was unsuccessful
 *
 */
__STATIC_INLINE bool DL_RTC_Common_isCalibrationWriteResultOK(
    const RTC_Regs *rtc_common)
{
    return ((rtc_common->STA & RTC_STA_RTCTCOK_MASK) == RTC_STA_RTCTCOK_OK);
}

/**
 *  @brief      Sets output frequency for offset calibration / 设置偏移校准输出频率
 *
 * Sets the frequency output to RTC_OUT pin for calibration measurement.
 * The corresponding port must be configured for the peripheral module
 * function.
 *
 *  @param[in]  rtc_common   Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  offsetFrequency   The frequency of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY
 */
__STATIC_INLINE void DL_RTC_Common_setOffsetCalibrationFrequency(
    RTC_Regs *rtc_common,
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY offsetFrequency)
{
    DL_Common_updateReg(
        &rtc_common->CAL, (uint32_t) offsetFrequency, RTC_CAL_RTCCALFX_MASK);
}

/**
 *  @brief      Sets the offset error calibration adjustment value. / 设置偏移校准调整值
 *
 * Each LSB represents approximately +1ppm (RTCOCALXS = 1) or
 * -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration
 * value is +/-240ppm.
 * Excess values written above +/-240ppm will be ignored by hardware.
 *
 *  @param[in]  rtc_common   Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  offsetSign        The sign of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN
 *  @param[in]  offsetValue       The value that the offset will be a factor of.
 *                                Must be any integer from 1-240.
 */
__STATIC_INLINE void DL_RTC_Common_setOffsetCalibrationAdjValue(
    RTC_Regs *rtc_common, DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN offsetSign,
    uint8_t offsetValue)
{
    DL_Common_updateReg(&rtc_common->CAL,
        ((uint32_t) offsetSign | (uint32_t) offsetValue),
        (RTC_CAL_RTCOCALX_MASK | RTC_CAL_RTCOCALS_MASK));
}

/**
 *  @brief      Sets the offset error calibration. / 设置偏移校准参数
 *
 * Each LSB represents approximately +1ppm (RTCOCALXS = 1) or
 * -1ppm (RTCOCALXS = 0) adjustment in frequency. Maximum effective calibration
 * value is +/-240ppm.
 * Excess values written above +/-240ppm will be ignored by hardware.
 *
 * Sets the frequency output to RTCCLK pin for calibration measurement.
 * The corresponding port must be configured for the peripheral module
 * function.
 *
 *  @param[in]  rtc_common   Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  offsetFrequency   The frequency of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY
 *  @param[in]  offsetSign        The sign of offset calibration.
 *                                Valid values are one of
 *                                @ref DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN
 *  @param[in]  offsetValue       The value that the offset will be a factor of.
 *                                Must be any integer from 1-240.
 */
__STATIC_INLINE void DL_RTC_Common_setOffsetCalibration(RTC_Regs *rtc_common,
    DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY offsetFrequency,
    DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN offsetSign, uint8_t offsetValue)
{
    rtc_common->CAL = (offsetValue & RTC_CAL_RTCOCALX_MASK) |
                      (uint32_t) offsetFrequency | (uint32_t) offsetSign;
}

/**
 *  @brief      Gets the offset calibration frequency. / 获取偏移校准频率
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Frequency used in offset calibration.
 *
 *  @retval            One of @ref DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY
 */
__STATIC_INLINE DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY
DL_RTC_Common_getOffsetCalibrationFrequency(const RTC_Regs *rtc_common)
{
    uint32_t freq = (rtc_common->CAL & RTC_CAL_RTCCALFX_MASK);

    return (DL_RTC_COMMON_OFFSET_CALIBRATION_FREQUENCY)(freq);
}

/**
 *  @brief      Gets the offset calibration sign. / 获取偏移校准方向
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            Sign used in offset calibration.
 *
 *  @retval            One of @ref DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN
 */
__STATIC_INLINE DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN
DL_RTC_Common_getOffsetCalibrationSign(const RTC_Regs *rtc_common)
{
    uint32_t sign = (rtc_common->CAL & RTC_CAL_RTCOCALS_MASK);

    return (DL_RTC_COMMON_OFFSET_CALIBRATION_SIGN)(sign);
}

/**
 *  @brief      Set the specified RTC Common temperature compensation. / 设置温度补偿
 *
 *  This function sets the calibration offset to make the RTC Common as accurate as
 *  possible. The offsetDirection can be either +1-ppm or -1-ppm, and the
 *  offsetValue should be from 1-240 and is multiplied by the direction setting
 *  (i.e. +1-ppm * 8 (offsetValue) = +8-ppm).
 *
 *  @param[in]  rtc_common             Pointer to the register overlay for the RTC Common
 *                                peripheral
 *  @param[in]  offsetDirection   The direction that the calibration offset
 *                                will go. Valid values are one of
 *                                @ref DL_RTC_COMMON_TEMP_CALIBRATION
 *  @param[in]  offsetValue       The value that the offset will be a factor of.
 *                                Must be any integer from 1-240.
 */
__STATIC_INLINE void DL_RTC_Common_setTemperatureCompensation(
    RTC_Regs *rtc_common, DL_RTC_COMMON_TEMP_CALIBRATION offsetDirection,
    uint32_t offsetValue)
{
    rtc_common->TCMP =
        (offsetValue & RTC_TCMP_RTCTCMPX_MASK) | (uint32_t) offsetDirection;
}

/**
 *  @brief      Get the RTC Common temperature compensation. / 获取温度补偿值
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The cumulative temperature compensation
 *
 *  @retval            Signed addition of RTCOCALX and RTCTCMPX values, and
 *                     the updated sign bit (RTCTCMPS) of the addition result.
 *
 */
__STATIC_INLINE uint32_t DL_RTC_Common_getTemperatureCompensation(
    const RTC_Regs *rtc_common)
{
    return (rtc_common->TCMP);
}

/**
 *  @brief      Set the seconds in BCD in the RTC Common calendar / 设置日历秒（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  seconds    Value for the seconds of the RTC Common calendar
 *                         Valid values are 0x0-0x59.
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarSecondsBCD(
    RTC_Regs *rtc_common, uint8_t seconds)
{
    rtc_common->SEC = ((uint32_t) seconds << RTC_SEC_SECLOWBCD_OFS) &
                      (RTC_SEC_SECLOWBCD_MASK | RTC_SEC_SECHIGHBCD_MASK);
}

/**
 *  @brief      Get the seconds in in BCD the RTC Common calendar / 获取日历秒（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The seconds in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarSecondsBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->SEC &
                         (RTC_SEC_SECLOWBCD_MASK | RTC_SEC_SECHIGHBCD_MASK)) >>
                     RTC_SEC_SECLOWBCD_OFS);
}

/**
 *  @brief      Set the minutes in in BCD the RTC Common calendar / 设置日历分（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  minutes    Value for the minutes of the RTC Common calendar
 *                         Valid values are 0x0-0x59.
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarMinutesBCD(
    RTC_Regs *rtc_common, uint8_t minutes)
{
    rtc_common->MIN = ((uint32_t) minutes << RTC_MIN_MINLOWBCD_OFS) &
                      (RTC_MIN_MINLOWBCD_MASK | RTC_MIN_MINHIGHBCD_MASK);
}

/**
 *  @brief      Get the minutes in in BCD the RTC Common calendar / 获取日历分（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The minutes in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarMinutesBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->MIN &
                         (RTC_MIN_MINLOWBCD_MASK | RTC_MIN_MINHIGHBCD_MASK)) >>
                     RTC_MIN_MINLOWBCD_OFS);
}

/**
 *  @brief      Set the hours in in BCD the RTC Common calendar / 设置日历时（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  hours    Value for the hours of the RTC Common calendar
 *                       Valid values are 0x0-0x23
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarHoursBCD(
    RTC_Regs *rtc_common, uint8_t hours)
{
    rtc_common->HOUR = ((uint32_t) hours << RTC_HOUR_HOURLOWBCD_OFS) &
                       (RTC_HOUR_HOURLOWBCD_MASK | RTC_HOUR_HOURHIGHBCD_MASK);
}

/**
 *  @brief      Get the hours in in BCD the RTC Common calendar / 获取日历时（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The hours in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarHoursBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->HOUR & (RTC_HOUR_HOURLOWBCD_MASK |
                                             RTC_HOUR_HOURHIGHBCD_MASK)) >>
                     RTC_HOUR_HOURLOWBCD_OFS);
}

/**
 *  @brief      Set the day of the week in BCD in the RTC Common calendar / 设置日历星期（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the week of the RTC Common calendar
 *                     Valid values are 0x0-0x6
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarDayOfWeekBCD(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->DAY, day, RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Get the day of the week in BCD in the RTC Common calendar / 获取日历星期（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the week in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarDayOfWeekBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->DAY & RTC_DAY_DOW_MASK);
}

/**
 *  @brief      Set the day of the month in BCD in the RTC Common calendar / 设置日历日（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the month of the RTC Common calendar
 *                     Valid values are 0x1-0x31
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarDayOfMonthBCD(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->DAY,
        (uint32_t) day << RTC_DAY_DOMLOWBCD_OFS,
        (RTC_DAY_DOMLOWBCD_MASK | RTC_DAY_DOMHIGHBCD_MASK));
}

/**
 *  @brief      Get the day of the month in BCD in the RTC Common calendar / 获取日历日（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The day of the month in the RTC Common calendar
 *
 *  @retval            Value in range: 0x1-0x31
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarDayOfMonthBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->DAY &
                         (RTC_DAY_DOMLOWBCD_MASK | RTC_DAY_DOMHIGHBCD_MASK)) >>
                     RTC_DAY_DOMLOWBCD_OFS);
}

/**
 *  @brief      Set the month in in BCD the RTC Common calendar / 设置日历月（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  month    Value for the month of the RTC Common calendar
 *                       Valid values are 0x1-0x12
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarMonthBCD(
    RTC_Regs *rtc_common, uint8_t month)
{
    rtc_common->MON = ((uint32_t) month << RTC_MON_MONLOWBCD_OFS) &
                      (RTC_MON_MONLOWBCD_MASK | RTC_MON_MONHIGHBCD_MASK);
}

/**
 *  @brief      Get the month of the year in BCD in the RTC Common calendar / 获取日历月（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The month of the year in the RTC Common calendar
 *
 *  @retval            Value in range: 0x1-0x12
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getCalendarMonthBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->MON &
                         (RTC_MON_MONLOWBCD_MASK | RTC_MON_MONHIGHBCD_MASK)) >>
                     RTC_MON_MONLOWBCD_OFS);
}

/**
 *  @brief      Set the year in in BCD the RTC Common calendar / 设置日历年（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  year    Value for the year of the RTC Common calendar
 *                      Valid values are 0x0-0x4095
 */
__STATIC_INLINE void DL_RTC_Common_setCalendarYearBCD(
    RTC_Regs *rtc_common, uint16_t year)
{
    rtc_common->YEAR =
        ((uint32_t) year << RTC_YEAR_YEARLOWESTBCD_OFS) &
        (RTC_YEAR_YEARLOWESTBCD_MASK | RTC_YEAR_DECADEBCD_MASK |
            RTC_YEAR_CENTLOWBCD_MASK | RTC_YEAR_CENTHIGHBCD_MASK);
}

/**
 *  @brief      Get the year in in BCD the RTC Common calendar / 获取日历年（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @pre To prevent reading any counter/calendar registers while those registers
 *  are being updated, the user can call @ref DL_RTC_Common_isSafeToRead to ensure that
 *  the registers are safe to read.
 *
 *  @return            The year in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x4095
 *
 */
__STATIC_INLINE uint16_t DL_RTC_Common_getCalendarYearBCD(
    const RTC_Regs *rtc_common)
{
    return (uint16_t)(
        (rtc_common->YEAR &
            (RTC_YEAR_YEARLOWESTBCD_MASK | RTC_YEAR_DECADEBCD_MASK |
                RTC_YEAR_CENTLOWBCD_MASK | RTC_YEAR_CENTHIGHBCD_MASK)) >>
        RTC_YEAR_YEARLOWESTBCD_OFS);
}

/**
 *  @brief      Enable minutes in BCD for RTC Common Calendar Alarm 1 / 使能闹钟1分匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1MinutesBCD(RTC_Regs *rtc_common)
{
    rtc_common->A1MIN |= RTC_A1MIN_AMINAEBCD_ENABLE;
}

/**
 *  @brief      Disable minutes in BCD for RTC Common Calendar Alarm 1 / 禁用闹钟1分匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1MinutesBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A1MIN &= ~(RTC_A1MIN_AMINAEBCD_MASK);
}

/**
 *  @brief      Set the minutes in BCD for RTC Common Calendar Alarm 1 / 设置闹钟1分（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  minutes    Value for the minutes of alarm 1
 *                         Valid values are 0x0-0x59
 *
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1MinutesBCD(
    RTC_Regs *rtc_common, uint8_t minutes)
{
    rtc_common->A1MIN =
        ((uint32_t) minutes << RTC_A1MIN_AMINLOWBCD_OFS) &
        (RTC_A1MIN_AMINLOWBCD_MASK | RTC_A1MIN_AMINHIGHBCD_MASK);
}

/**
 *  @brief      Get the minutes in BCD for RTC Common Calendar Alarm 1 / 获取闹钟1分（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The minutes of alarm 1
 *
 *  @retval            Value in range: 0x0-0x59
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1MinutesBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)((rtc_common->A1MIN & (RTC_A1MIN_AMINLOWBCD_MASK |
                                              RTC_A1MIN_AMINHIGHBCD_MASK)) >>
                     RTC_A1MIN_AMINLOWBCD_OFS);
}

/**
 *  @brief      Enable hours in BCD for RTC Common Calendar Alarm 1 / 使能闹钟1时匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1HoursBCD(RTC_Regs *rtc_common)
{
    rtc_common->A1HOUR |= RTC_A1HOUR_AHOURAEBCD_ENABLE;
}

/**
 *  @brief      Disable hours in BCD for RTC Common Calendar Alarm 1 / 禁用闹钟1时匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1HoursBCD(RTC_Regs *rtc_common)
{
    rtc_common->A1HOUR &= ~(RTC_A1HOUR_AHOURAEBCD_MASK);
}

/**
 *  @brief      Set the hours in BCD for RTC Common Calendar Alarm 1 / 设置闹钟1时（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  hours    Value for the hours of alarm 1
 *                       Valid values are 0x0-0x23
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1HoursBCD(
    RTC_Regs *rtc_common, uint8_t hours)
{
    rtc_common->A1HOUR =
        ((uint32_t) hours << RTC_A1HOUR_AHOURLOWBCD_OFS) &
        (RTC_A1HOUR_AHOURLOWBCD_MASK | RTC_A1HOUR_AHOURHIGHBCD_MASK);
}

/**
 *  @brief      Get the hours in BCD for RTC Common Calendar Alarm 1 / 获取闹钟1时（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The hours of alarm 1
 *
 *  @retval            Value in range: 0x0-0x23
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1HoursBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(
        (rtc_common->A1HOUR &
            (RTC_A1HOUR_AHOURLOWBCD_MASK | RTC_A1HOUR_AHOURHIGHBCD_MASK)) >>
        RTC_A1HOUR_AHOURLOWBCD_OFS);
}

/**
 *  @brief      Enable day of the week in BCD for RTC Common Calendar Alarm 1 / 使能闹钟1星期匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1DayOfWeekBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY |= RTC_A1DAY_ADOWAE_ENABLE;
}

/**
 *  @brief      Disable day of the week in BCD for RTC Common Calendar Alarm 1 / 禁用闹钟1星期匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1DayOfWeekBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY &= ~(RTC_A1DAY_ADOWAE_MASK);
}

/**
 *  @brief      Set the day of the week in BCD for RTC Common Calendar Alarm 1 / 设置闹钟1星期（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the week of the RTC Common calendar
 *                     Valid values are 0x0-0x6
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1DayOfWeekBCD(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A1DAY, day, RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Get the day of the week in BCD for RTC Common Calendar Alarm 1 / 获取闹钟1星期（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 *  @return            The day of the week in the RTC Common calendar
 *
 *  @retval            Value in range: 0x0-0x6
 *
 */
__STATIC_INLINE uint8_t DL_RTC_Common_getAlarm1DayOfWeekBCD(
    const RTC_Regs *rtc_common)
{
    return (uint8_t)(rtc_common->DAY & RTC_A1DAY_ADOW_MASK);
}

/**
 *  @brief      Enable day of the month in BCD for RTC Common Calendar Alarm 1 / 使能闹钟1日匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_enableAlarm1DayOfMonthBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY |= RTC_A1DAY_ADOMAEBCD_ENABLE;
}

/**
 *  @brief      Disable day of the month in BCD for RTC Common Calendar Alarm 1 / 禁用闹钟1日匹配（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *
 */
__STATIC_INLINE void DL_RTC_Common_disableAlarm1DayOfMonthBCD(
    RTC_Regs *rtc_common)
{
    rtc_common->A1DAY &= ~(RTC_A1DAY_ADOMAEBCD_MASK);
}

/**
 *  @brief      Set the day of the month in BCD for RTC Common Calendar Alarm 1 / 设置闹钟1日（BCD）
 *
 *  @param[in]  rtc_common  Pointer to the register overlay for the RTC Common peripheral
 *  @param[in]  day    Value for the day of the month of the RTC Common calendar
 *                     Valid values are 0x1-0x31
 */
__STATIC_INLINE void DL_RTC_Common_setAlarm1DayOfMonthBCD(
    RTC_Regs *rtc_common, uint8_t day)
{
    DL_Common_updateReg(&rtc_common->A1DAY,
        (uint32_t) day << RTC_A1DAY_ADOMLOWBCD_OFS,
        (RTC_A1DAY_ADOMLOWBCD_MASK | RTC_A1DAY_ADOMHIGHBCD_MASK));
}

